## Flight Price Prediction (EDA and Feature Engineering )

In [61]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

##### Feature Engineering

In [220]:
df_train=pd.read_excel("Data_Train.xlsx")

In [221]:
df_train.sample(5)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
7931,SpiceJet,15/03/2019,Mumbai,Hyderabad,BOM → HYD,22:45,00:10 16 Mar,1h 25m,non-stop,No info,2753
10062,Jet Airways,15/06/2019,Delhi,Cochin,DEL → JDH → BOM → COK,11:40,19:00,7h 20m,2 stops,No info,18804
3355,IndiGo,6/05/2019,Kolkata,Banglore,CCU → PAT → BLR,09:20,14:15,4h 55m,1 stop,No info,11319
9257,Jet Airways,27/06/2019,Mumbai,Hyderabad,BOM → HYD,02:55,04:20,1h 25m,non-stop,In-flight meal not included,3210
6603,Air Asia,9/05/2019,Delhi,Cochin,DEL → BLR → COK,20:45,07:10 10 May,10h 25m,1 stop,No info,6751

In [222]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [223]:
df_test=pd.read_excel("Test_set.xlsx")

In [224]:
df_test.sample(5)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
2494,Air India,12/06/2019,Kolkata,Banglore,CCU → IXR → DEL → BLR,05:50,12:30 13 Jun,30h 40m,2 stops,No info
938,IndiGo,9/05/2019,Delhi,Cochin,DEL → BOM → COK,16:00,21:00,5h,1 stop,No info
2045,Multiple carriers,27/05/2019,Delhi,Cochin,DEL → BOM → COK,12:50,19:15,6h 25m,1 stop,No info
446,Jet Airways,27/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,09:40,12:35 28 Jun,26h 55m,2 stops,No info
1010,Jet Airways,1/06/2019,Banglore,Delhi,BLR → DEL,11:10,14:05,2h 55m,non-stop,No info

#### Merging both train and test

In [225]:
df=df_train.append(df_test,ignore_index=True)

In [226]:
df.tail(3)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
13351,Jet Airways,6/03/2019,Delhi,Cochin,DEL → BOM → COK,21:50,04:25 07 Mar,6h 35m,1 stop,No info,NaN
13352,Air India,6/03/2019,Delhi,Cochin,DEL → BOM → COK,04:00,19:15,15h 15m,1 stop,No info,NaN
13353,Multiple carriers,15/06/2019,Delhi,Cochin,DEL → BOM → COK,04:55,19:15,14h 20m,1 stop,No info,NaN

In [227]:
df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

##### Converting Date od Journey column into integer

In [228]:
df['Date_of_Journey']

0        24/03/2019
1         1/05/2019
2         9/06/2019
3        12/05/2019
4        01/03/2019
            ...
13349     6/06/2019
13350    27/03/2019
13351     6/03/2019
13352     6/03/2019
13353    15/06/2019
Name: Date_of_Journey, Length: 13354, dtype: object

In [229]:
df.Date_of_Journey.str.split('/').str[0]

0        24
1         1
2         9
3        12
4        01
         ..
13349     6
13350    27
13351     6
13352     6
13353    15
Name: Date_of_Journey, Length: 13354, dtype: object

In [230]:
df.Date_of_Journey.str.split('/').str[2]

0        2019
1        2019
2        2019
3        2019
4        2019
         ...
13349    2019
13350    2019
13351    2019
13352    2019
13353    2019
Name: Date_of_Journey, Length: 13354, dtype: object

In [231]:
df.shape

(13354, 11)

##### Derived Feature

In [232]:
df['Date']=df.Date_of_Journey.str.split('/').str[0]
df['Month']=df.Date_of_Journey.str.split('/').str[1]
df['Year']=df.Date_of_Journey.str.split('/').str[2]

In [190]:
#or 
#df['Date']=df['Date_of_Journey'].apply(lambda x:x.split('/')[0])
#df['Month']=df['Date_of_Journey'].apply(lambda x:x.split('/')[1])
#df['Year']=df['Date_of_Journey'].apply(lambda x:x.split('/')[2])

In [233]:
df.drop(['Date_of_Journey'],axis=1,inplace=True)

In [234]:
df.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,06,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,05,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0,01,03,2019

In [235]:
df.dtypes

Airline             object
Source              object
Destination         object
Route               object
Dep_Time            object
Arrival_Time        object
Duration            object
Total_Stops         object
Additional_Info     object
Price              float64
Date                object
Month               object
Year                object
dtype: object

In [236]:
df.Date=df.Date.astype('int64')
df.Month=df.Month.astype('int64')
df.Year=df.Year.astype('int64')

In [237]:
df.dtypes

Airline             object
Source              object
Destination         object
Route               object
Dep_Time            object
Arrival_Time        object
Duration            object
Total_Stops         object
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
dtype: object

In [238]:
df.head(4)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019

##### Converting Arrival, Departure and Duration time into integer values

In [239]:
df['Arrival_Time'].apply(lambda x:x.split(' ')[0])

0        01:10
1        13:15
2        04:25
3        23:30
4        21:35
         ...
13349    20:25
13350    16:55
13351    04:25
13352    19:15
13353    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [240]:
df['Arrival_Time'].str.split(' ').str[0]

0        01:10
1        13:15
2        04:25
3        23:30
4        21:35
         ...
13349    20:25
13350    16:55
13351    04:25
13352    19:15
13353    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [241]:
df['Arrival_Time']=df['Arrival_Time'].apply(lambda x:x.split(' ')[0])

In [242]:
df.isnull().mean()*100

Airline             0.000000
Source              0.000000
Destination         0.000000
Route               0.007488
Dep_Time            0.000000
Arrival_Time        0.000000
Duration            0.000000
Total_Stops         0.007488
Additional_Info     0.000000
Price              20.001498
Date                0.000000
Month               0.000000
Year                0.000000
dtype: float64

In [243]:
df['Arrival_hour']=df['Arrival_Time'].apply(lambda x:x.split(':')[0])

In [244]:
df['Arrival_mint']=df['Arrival_Time'].apply(lambda x:x.split(':')[1])

In [245]:
df['Arrival_hour']=df['Arrival_hour'].astype('int64')

In [246]:
df['Arrival_mint']=df['Arrival_mint'].astype('int64')

In [247]:
df.dtypes

Airline             object
Source              object
Destination         object
Route               object
Dep_Time            object
Arrival_Time        object
Duration            object
Total_Stops         object
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
dtype: object

In [248]:
df.drop(['Arrival_Time'],axis=1,inplace=True)

In [249]:
df['Dept_hours']=df['Dep_Time'].apply(lambda x:x.split(':')[0])

In [250]:
df['Dept_mint']=df['Dep_Time'].apply(lambda x:x.split(':')[1])

In [251]:
df.drop(['Dep_Time'],axis=1,inplace=True)

In [252]:
df['Dept_mint']=df['Dept_mint'].astype('int64')
df['Dept_hours']=df['Dept_hours'].astype('int64')

In [253]:
df.dtypes

Airline             object
Source              object
Destination         object
Route               object
Duration            object
Total_Stops         object
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
dtype: object

In [254]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [255]:
df['Total_Stops']=df['Total_Stops'].map({'non-stop':0,'1 stop':1,'2 stops':2,'3 stops':3,'4 stops':4,np.nan:1})

In [256]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2,No info,7662.0,1,5,2019,13,15,5,50

In [257]:
df.Total_Stops.mode()

0    1
dtype: int64

In [258]:
df[df.Total_Stops.isnull()==True]

Empty DataFrame
Columns: [Airline, Source, Destination, Route, Duration, Total_Stops, Additional_Info, Price, Date, Month, Year, Arrival_hour, Arrival_mint, Dept_hours, Dept_mint]
Index: []

In [260]:
df.drop(['Route'],axis=1,inplace=True)

In [261]:
df.dtypes

Airline             object
Source              object
Destination         object
Duration            object
Total_Stops          int64
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
dtype: object

In [262]:
df.head(3)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint
0,IndiGo,Banglore,New Delhi,2h 50m,0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,7h 25m,2,No info,7662.0,1,5,2019,13,15,5,50
2,Jet Airways,Delhi,Cochin,19h,2,No info,13882.0,9,6,2019,4,25,9,25

In [264]:
df.Additional_Info.unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [265]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Duration         13354 non-null  object
 4   Total_Stops      13354 non-null  int64
 5   Additional_Info  13354 non-null  object
 6   Price            10683 non-null  float64
 7   Date             13354 non-null  int64
 8   Month            13354 non-null  int64
 9   Year             13354 non-null  int64
 10  Arrival_hour     13354 non-null  int64
 11  Arrival_mint     13354 non-null  int64
 12  Dept_hours       13354 non-null  int64
 13  Dept_mint        13354 non-null  int64
dtypes: float64(1), int64(8), object(5)
memory usage: 1.4+ MB

In [285]:
df.Duration.str.split('h').str[0]

0         2
1         7
2        19
3         5
4         4
         ..
13349    23
13350     2
13351     6
13352    15
13353    14
Name: Duration, Length: 13354, dtype: object

In [287]:
df['duration_hours']=df.Duration.str.split('h').str[0]

In [289]:
df['duration_hours']

0         2
1         7
2        19
3         5
4         4
         ..
13349    23
13350     2
13351     6
13352    15
13353    14
Name: duration_hours, Length: 13354, dtype: object

In [299]:
df['duration_hours']=df['duration_hours'].apply(lambda x:x.split('m')[0])

In [301]:
df['duration_hours'].unique()

array(['2', '7', '19', '5', '4', '15', '21', '25', '13', '12', '26', '22',
       '23', '20', '10', '6', '11', '8', '16', '3', '27', '1', '14', '9',
       '18', '17', '24', '30', '28', '29', '37', '34', '38', '35', '36',
       '47', '33', '32', '31', '42', '39', '41', '40'], dtype=object)

In [303]:
df['duration_hours']=df['duration_hours'].astype('int64')

In [350]:
df.drop(6474,axis=0,inplace=True)
df.drop(2660,axis=0,inplace=True)

In [305]:
df['duration_hours']=df['duration_hours'].apply(lambda x:x*60)

In [314]:
df['duration_mint']=df.Duration.str.split(' ').str[1]

In [315]:
df['duration_mint'].unique()

array(['50m', '25m', nan, '45m', '30m', '5m', '15m', '35m', '10m', '20m',
       '55m', '40m'], dtype=object)

In [321]:
df['duration_mint'].unique()

array(['50m', '25m', nan, '45m', '30m', '5m', '15m', '35m', '10m', '20m',
       '55m', '40m'], dtype=object)

In [328]:
df['duration_mint'].isnull().sum()

1286

In [331]:
df.dtypes

Airline             object
Source              object
Destination         object
Duration            object
Total_Stops          int64
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
duration_hours       int64
duration_mint       object
dtype: object

In [345]:
df['duration_mint'].fillna(0)

0        50m
1        25m
2          0
3        25m
4        45m
        ...
13349    55m
13350    35m
13351    35m
13352    15m
13353    20m
Name: duration_mint, Length: 13354, dtype: object

In [346]:
df['duration_mint'].isnull().sum()

1286

In [351]:
df['duration_mint'].unique()

array(['50m', '25m', nan, '45m', '30m', '5m', '15m', '35m', '10m', '20m',
       '55m', '40m'], dtype=object)

In [361]:
df.duration_mint.str.split('m').str[0]

0         50
1         25
2        NaN
3         25
4         45
        ...
13349     55
13350     35
13351     35
13352     15
13353     20
Name: duration_mint, Length: 13352, dtype: object

In [357]:
df.duration_mint.isnull().sum()

1284

In [355]:
df[df['duration_mint'].isnull()]

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint,duration_hours,duration_mint
2,Jet Airways,Delhi,Cochin,19h,2,No info,13882.0,9,6,2019,4,25,9,25,1140,NaN
18,Air India,Delhi,Cochin,23h,2,No info,13381.0,12,6,2019,19,15,20,15,1380,NaN
33,Jet Airways,Delhi,Cochin,22h,2,In-flight meal not included,10919.0,15,6,2019,12,35,14,35,1320,NaN
44,Multiple carriers,Delhi,Cochin,12h,1,No info,13062.0,21,3,2019,21,0,9,0,720,NaN
53,IndiGo,Banglore,Delhi,3h,0,No info,3943.0,18,6,2019,0,15,21,15,180,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13281,Jet Airways,Delhi,Cochin,11h,1,No info,NaN,9,6,2019,19,0,8,0,660,NaN
13287,Multiple carriers,Delhi,Cochin,10h,1,No info,NaN,12,6,2019,19,15,9,15,600,NaN
13290,Multiple carriers,Delhi,Cochin,13h,1,No info,NaN,3,3,2019,21,0,8,0,780,NaN
13305,Jet Airways,Banglore,Delhi,3h,0,In-flight meal not included,NaN,3,5,2019,20,45,17,45,180,NaN
13343,Air India,Mumbai,Hyderabad,5m,2,No info,NaN,12,3,2019,16,55,16,50,300,NaN

In [362]:
df['duration_mint']=df.duration_mint.str.split('m').str[0]

In [368]:
df['duration_mint'].isnull().sum()

1284

In [370]:
df['duration_mint']=df['duration_mint'].replace(np.nan,0)

In [372]:
df['duration_mint'].isnull().sum()

0

In [375]:
df.dtypes

Airline             object
Source              object
Destination         object
Duration            object
Total_Stops          int64
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
duration_hours       int64
duration_mint       object
dtype: object

In [377]:
df['duration_mint']=df['duration_mint'].astype('int64')

In [378]:
df['duration_hours']+df['duration_mint']

0         170
1         445
2        1140
3         325
4         285
         ...
13349    1435
13350     155
13351     395
13352     915
13353     860
Length: 13352, dtype: int64

In [379]:
df['Duration']=df['duration_hours']+df['duration_mint']

In [382]:
df.drop(['duration_mint','duration_hours'],axis=1,inplace=True)

In [383]:
df.head()

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint
0,IndiGo,Banglore,New Delhi,170,0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,445,2,No info,7662.0,1,5,2019,13,15,5,50
2,Jet Airways,Delhi,Cochin,1140,2,No info,13882.0,9,6,2019,4,25,9,25
3,IndiGo,Kolkata,Banglore,325,1,No info,6218.0,12,5,2019,23,30,18,5
4,IndiGo,Banglore,New Delhi,285,1,No info,13302.0,1,3,2019,21,35,16,50

In [384]:
df.dtypes

Airline             object
Source              object
Destination         object
Duration             int64
Total_Stops          int64
Additional_Info     object
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
dtype: object

In [385]:
df['Airline']

0                   IndiGo
1                Air India
2              Jet Airways
3                   IndiGo
4                   IndiGo
               ...
13349            Air India
13350               IndiGo
13351          Jet Airways
13352            Air India
13353    Multiple carriers
Name: Airline, Length: 13352, dtype: object

##### Performing Label encoding and OnehotEncoding

In [386]:
from sklearn.preprocessing import LabelEncoder
label_encod= LabelEncoder()

In [388]:
df['Airline']=label_encod.fit_transform(df['Airline'])

In [391]:
df['Source']=label_encod.fit_transform(df['Source'])
df['Destination']=label_encod.fit_transform(df['Destination'])
df['Additional_Info']=label_encod.fit_transform(df['Additional_Info'])

In [396]:
df.sample(4)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint
1362,4,2,1,1775,2,8,15129.0,21,5,2019,19,0,13,25
1849,4,0,2,165,0,5,4030.0,15,5,2019,8,45,6,0
5391,4,2,1,1195,2,8,12819.0,24,6,2019,19,0,23,5
797,6,2,1,750,1,5,6943.0,27,5,2019,1,30,13,0

In [397]:
df.dtypes

Airline              int32
Source               int64
Destination          int64
Duration             int64
Total_Stops          int64
Additional_Info      int32
Price              float64
Date                 int64
Month                int64
Year                 int64
Arrival_hour         int64
Arrival_mint         int64
Dept_hours           int64
Dept_mint            int64
dtype: object

In [399]:
df=pd.get_dummies(df,columns=['Airline','Source','Destination','Additional_Info'],drop_first=True)

In [400]:
df.head()

,Duration,Total_Stops,Price,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint,...,Destination_5,Additional_Info_1,Additional_Info_2,Additional_Info_3,Additional_Info_4,Additional_Info_5,Additional_Info_6,Additional_Info_7,Additional_Info_8,Additional_Info_9
0,170,0,3897.0,24,3,2019,1,10,22,20,...,1,0,0,0,0,0,0,0,1,0
1,445,2,7662.0,1,5,2019,13,15,5,50,...,0,0,0,0,0,0,0,0,1,0
2,1140,2,13882.0,9,6,2019,4,25,9,25,...,0,0,0,0,0,0,0,0,1,0
3,325,1,6218.0,12,5,2019,23,30,18,5,...,0,0,0,0,0,0,0,0,1,0
4,285,1,13302.0,1,3,2019,21,35,16,50,...,1,0,0,0,0,0,0,0,1,0

In [411]:
df=df[~df['Price'].isnull()]

In [405]:
df_cross_val.columns

Index(['Duration', 'Total_Stops', 'Price', 'Date', 'Month', 'Year',
       'Arrival_hour', 'Arrival_mint', 'Dept_hours', 'Dept_mint', 'Airline_1',
       'Airline_2', 'Airline_3', 'Airline_4', 'Airline_5', 'Airline_6',
       'Airline_7', 'Airline_8', 'Airline_9', 'Airline_10', 'Airline_11',
       'Source_1', 'Source_2', 'Source_3', 'Source_4', 'Destination_1',
       'Destination_2', 'Destination_3', 'Destination_4', 'Destination_5',
       'Additional_Info_1', 'Additional_Info_2', 'Additional_Info_3',
       'Additional_Info_4', 'Additional_Info_5', 'Additional_Info_6',
       'Additional_Info_7', 'Additional_Info_8', 'Additional_Info_9'],
      dtype='object')

In [407]:
df_cross_val=df_cross_val[['Duration', 'Total_Stops', 'Date', 'Month', 'Year',
       'Arrival_hour', 'Arrival_mint', 'Dept_hours', 'Dept_mint', 'Airline_1',
       'Airline_2', 'Airline_3', 'Airline_4', 'Airline_5', 'Airline_6',
       'Airline_7', 'Airline_8', 'Airline_9', 'Airline_10', 'Airline_11',
       'Source_1', 'Source_2', 'Source_3', 'Source_4', 'Destination_1',
       'Destination_2', 'Destination_3', 'Destination_4', 'Destination_5',
       'Additional_Info_1', 'Additional_Info_2', 'Additional_Info_3',
       'Additional_Info_4', 'Additional_Info_5', 'Additional_Info_6',
       'Additional_Info_7', 'Additional_Info_8', 'Additional_Info_9','Price']]

In [408]:
df_cross_val.head(3)

,Duration,Total_Stops,Date,Month,Year,Arrival_hour,Arrival_mint,Dept_hours,Dept_mint,Airline_1,...,Additional_Info_1,Additional_Info_2,Additional_Info_3,Additional_Info_4,Additional_Info_5,Additional_Info_6,Additional_Info_7,Additional_Info_8,Additional_Info_9,Price
10683,655,1,6,6,2019,4,25,17,30,0,...,0,0,0,0,0,0,0,1,0,NaN
10684,240,1,12,5,2019,10,20,6,20,0,...,0,0,0,0,0,0,0,1,0,NaN
10685,1425,1,21,5,2019,19,0,19,15,0,...,0,0,0,0,1,0,0,0,0,NaN

In [425]:
df_cross_val=df_cross_val.iloc[:,:-1]

In [412]:
df.columns

Index(['Duration', 'Total_Stops', 'Price', 'Date', 'Month', 'Year',
       'Arrival_hour', 'Arrival_mint', 'Dept_hours', 'Dept_mint', 'Airline_1',
       'Airline_2', 'Airline_3', 'Airline_4', 'Airline_5', 'Airline_6',
       'Airline_7', 'Airline_8', 'Airline_9', 'Airline_10', 'Airline_11',
       'Source_1', 'Source_2', 'Source_3', 'Source_4', 'Destination_1',
       'Destination_2', 'Destination_3', 'Destination_4', 'Destination_5',
       'Additional_Info_1', 'Additional_Info_2', 'Additional_Info_3',
       'Additional_Info_4', 'Additional_Info_5', 'Additional_Info_6',
       'Additional_Info_7', 'Additional_Info_8', 'Additional_Info_9'],
      dtype='object')

In [414]:
df=df[['Duration', 'Total_Stops', 'Date', 'Month', 'Year',
       'Arrival_hour', 'Arrival_mint', 'Dept_hours', 'Dept_mint', 'Airline_1',
       'Airline_2', 'Airline_3', 'Airline_4', 'Airline_5', 'Airline_6',
       'Airline_7', 'Airline_8', 'Airline_9', 'Airline_10', 'Airline_11',
       'Source_1', 'Source_2', 'Source_3', 'Source_4', 'Destination_1',
       'Destination_2', 'Destination_3', 'Destination_4', 'Destination_5',
       'Additional_Info_1', 'Additional_Info_2', 'Additional_Info_3',
       'Additional_Info_4', 'Additional_Info_5', 'Additional_Info_6',
       'Additional_Info_7', 'Additional_Info_8', 'Additional_Info_9','Price']]

In [409]:
from sklearn.model_selection import train_test_split

In [416]:
df.iloc[:,-1:]

         Price
0       3897.0
1       7662.0
2      13882.0
3       6218.0
4      13302.0
...        ...
10678   4107.0
10679   4145.0
10680   7229.0
10681  12648.0
10682  11753.0

[10681 rows x 1 columns]

In [417]:
X_train,X_test,y_train,y_test=train_test_split(df.iloc[:,:-1],df.iloc[:,-1:],test_size=0.3)

In [419]:
X_train.shape

(7476, 38)

In [420]:
X_test.shape

(3205, 38)

In [421]:
y_train.shape

(7476, 1)

In [422]:
y_test.shape

(3205, 1)

In [426]:
df_cross_val.shape

(2671, 38)

##### Ready to feed model